# 1절. 판다스 패키지
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터 프레임 제공
- 결측치 처리, 크기 변경(열삽입 삭제), 데이터 정렬, 데이터 분할, 병합, 데이터 프레임 생성, 부분 데이터 셋 추출, 피벗과 언피벗, 레이블링, 파일 입출력 등에 용이
- https://pypi.python.org/pypi/pandas (package index)
- http://pandas.pydata.org/pandas-docs/stable/api.html (API reference)

# 2절. 데이터프레임 만들기

## 2.1 딕셔너리를 이용해서 데이터 프레임 만들기

In [1]:
import pandas as pd
d = {'col1':[1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [2]:
d = [{'col1':1, 'col2':3},{'col1':2, 'col2':4}]
df = pd.DataFrame(data = d)
df

   col1  col2
0     1     3
1     2     4

In [3]:
d = [{'col1':1, 'col2':3},{'col1':2, 'col2':4},{'col1':2}]
df = pd.DataFrame(data=d)
df

   col1  col2
0     1   3.0
1     2   4.0
2     2   NaN

## 2.2 리스트를 이용해 데이터프레임 만들기

In [4]:
a = [1,2,3,4,5]
b = [6,7,8,9,10]
df = pd.DataFrame({'col1':a, 'col2':b})
df

   col1  col2
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [5]:
import numpy as np
a = [1,2,3,4,5]
b = [6,7,8,9,10]
df = pd.DataFrame(np.c_[a,b], columns=["col1", "col2"])
df

   col1  col2
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [6]:
np.c_[a,b]

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [7]:
np.r_[a,b]

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [8]:
np.c_[[a],[b]]

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10]])

In [9]:
df = pd.DataFrame(np.c_[[a],[b]], columns=["c1","c2","c3","c4","c5","c6","c7","c8","c9","c10"])
df

   c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
0   1   2   3   4   5   6   7   8   9   10

In [10]:
np.c_[a,b]

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [11]:
a = [[1,2,3,4,5]]
b = [[6,7,8,9,10]]
np.r_[a,b]

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [12]:
df = pd.DataFrame(np.r_[a,b])
df

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

# 2.3 read_csv()

In [20]:
df = pd.read_csv(r"C:\Users\82105\Desktop\data/상가업소정보_201912_01.csv", sep="|", encoding='cp949')
# 모든 컬럼이 표시되도록 max_columns 의 수 지정
pd.options.display.max_columns = 39
# head로 미리보기
df.head()

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,19905471,와라와라호프,NaN,Q,음식,Q09,유흥주점,Q09A01,호프/맥주,I56219,기타 주점업,11,서울특별시,11680,강남구,1168060000,대치1동,1168010600,대치동,1168010600206040000,1,대지,604,NaN,서울특별시 강남구 대치동 604,116802000003,서울특별시 강남구 남부순환로,2933,NaN,1168010600106040000014378,대치상가,서울특별시 강남구 남부순환로 2933,135280,6280.0,NaN,1,NaN,127.061026,37.493922
1,19911397,커피빈코리아선릉로93길점,코리아선릉로93길점,Q,음식,Q12,커피점/카페,Q12A01,커피전문점/카페/다방,I56220,비알콜 음료점업,11,서울특별시,11680,강남구,1168064000,역삼1동,1168010100,역삼동,1168010100206960042,1,대지,696,42.0,서울특별시 강남구 역삼동 696-42,116804166502,서울특별시 강남구 선릉로93길,6,NaN,1168010100106960042022041,NaN,서울특별시 강남구 선릉로93길 6,135080,6149.0,NaN,1,NaN,127.047883,37.505675
2,19911801,프로포즈,NaN,Q,음식,Q09,유흥주점,Q09A01,호프/맥주,I56219,기타 주점업,11,서울특별시,11545,금천구,1154563000,독산3동,1154510200,독산동,1154510200201620001,1,대지,162,1.0,서울특별시 금천구 독산동 162-1,115453117003,서울특별시 금천구 가산로,34,6.0,1154510200101620001017748,NaN,서울특별시 금천구 가산로 34-6,153010,8545.0,NaN,1,NaN,126.899220,37.471711
3,19912201,싱싱커피&토스트,NaN,Q,음식,Q07,패스트푸드,Q07A10,토스트전문,I56192,"피자, 햄버거, 샌드위치 및 유사 음식점업",26,부산광역시,26530,사상구,2653062000,괘법동,2653010400,괘법동,2653010400205780000,1,대지,578,NaN,부산광역시 사상구 괘법동 578,265303139004,부산광역시 사상구 괘감로,37,NaN,2653010400105780000002037,산업용품유통상가,부산광역시 사상구 괘감로 37,617726,46977.0,NaN,1,26,128.980455,35.159774
4,19932756,가락사우나내스낵,NaN,F,생활서비스,F09,대중목욕탕/휴게,F09A02,사우나/증기탕/온천,S96121,욕탕업,11,서울특별시,11710,송파구,1171060000,석촌동,1171010500,석촌동,1171010500202560000,1,대지,256,NaN,서울특별시 송파구 석촌동 256,117103123001,서울특별시 송파구 가락로,71,NaN,1171010500102560005010490,NaN,서울특별시 송파구 가락로 71,138846,5690.0,NaN,1,NaN,127.104071,37.500249

In [21]:
# (1) csv 파일 불러오기
import pandas as pd
member_df = pd.read_csv('data/ch12_member_data.csv', sep=",", encoding="utf-8")
member_df

   Name  Age             Email  Address
0   홍길동   20  kildong@hong.com  서울시 강동구
1   홍길서   25   kilseo@hong.com  서울시 강서구
2   홍길남   26    south@hong.com  서울시 강남구
3   홍길북   30    north@hong.com  서울시 강북구
4  #흉낄똥   26      kil@hong.com  서울시 마포구

In [22]:
import pandas as pd
member_df = pd.read_csv('data/ch12_member_data.csv', sep=",", encoding="utf-8")
member_df

   Name  Age             Email  Address
0   홍길동   20  kildong@hong.com  서울시 강동구
1   홍길서   25   kilseo@hong.com  서울시 강서구
2   홍길남   26    south@hong.com  서울시 강남구
3   홍길북   30    north@hong.com  서울시 강북구
4  #흉낄똥   26      kil@hong.com  서울시 마포구

In [23]:
type(member_df)

pandas.core.frame.DataFrame

In [24]:
type(member_df['Name'])

pandas.core.series.Series

In [25]:
# 2) 행 제외하기
member_df = pd.read_csv('data/ch12_member_data.csv', sep=',', skiprows=[0,3])
member_df

    홍길동  20 kildong@hong.com  서울시 강동구
0   홍길서  25  kilseo@hong.com  서울시 강서구
1   홍길북  30   north@hong.com  서울시 강북구
2  #흉낄똥  26     kil@hong.com  서울시 마포구

In [26]:
# 3) 주석행 지정하기
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

## 2.4 sklean.datasets 모듈 데이터를 데이터프레임으로 변환하기

In [27]:
import numpy as np
import pandas as pd
from sklearn import datasets
# Scikit-learn 패키지에는 학습을 위한 많은 데이터셋이 제공. 
# Scikit_learn에서 제공하는 데이터셋은 딕셔너리 형식으로 되어 있음.

In [28]:
iris = datasets.load_iris()
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'C:\\Users\\82105\\anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv'}

In [29]:
iris['feature_names']
iris.feature_names
[ name[:-5] for name in iris.feature_names ]

['sepal length', 'sepal width', 'petal length', 'petal width']

In [30]:
iris['target']
iris.target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [31]:
iris['target_names']
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [32]:
iris['target_names'][iris['target']]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [33]:
iris.target_names[iris.target]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [34]:
x = pd.DataFrame(iris.data, columns=iris.feature_names)
x

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [35]:
y = pd.DataFrame(iris.target_names[iris.target], columns=['species'])
y

       species
0       setosa
1       setosa
2       setosa
3       setosa
4       setosa
..         ...
145  virginica
146  virginica
147  virginica
148  virginica
149  virginica

[150 rows x 1 columns]

In [36]:
x = pd.DataFrame(iris.data, columns=iris.feature_names)
y = pd.DataFrame(iris['target_names'][iris['target']], columns=['species'])
iris_df = pd.concat([x, y], axis=1)
iris_df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [37]:
iris_df.head(-148)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa

In [38]:
iris_df.columns = [col[0:12].strip().replace(' ','_') for col in iris_df.columns]

In [39]:
iris_df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [40]:
iris_df.columns = ["sepal_length","sepal_width","petal_lenghth",
                  "petal_width","species"]

In [41]:
iris_df

     sepal_length  sepal_width  petal_lenghth  petal_width    species
0             5.1          3.5            1.4          0.2     setosa
1             4.9          3.0            1.4          0.2     setosa
2             4.7          3.2            1.3          0.2     setosa
3             4.6          3.1            1.5          0.2     setosa
4             5.0          3.6            1.4          0.2     setosa
..            ...          ...            ...          ...        ...
145           6.7          3.0            5.2          2.3  virginica
146           6.3          2.5            5.0          1.9  virginica
147           6.5          3.0            5.2          2.0  virginica
148           6.2          3.4            5.4          2.3  virginica
149           5.9          3.0            5.1          1.8  virginica

[150 rows x 5 columns]

# 3절. 이름 지정하기

## 3.1 열 이름 지정하기

In [42]:
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [43]:
member_df.columns = ["이름","나이","이메일","주소"]
member_df

    이름  나이               이메일       주소
0  홍길동  20  kildong@hong.com  서울시 강동구
1  홍길서  25   kilseo@hong.com  서울시 강서구
2  홍길남  26    south@hong.com  서울시 강남구
3  홍길북  30    north@hong.com  서울시 강북구

In [44]:
member_df.columns

Index(['이름', '나이', '이메일', '주소'], dtype='object')

## 3.2 행이름 지정하기

In [45]:
member_df.index

RangeIndex(start=0, stop=4, step=1)

In [46]:
member_df.index = ["동","서","남","북"]
member_df

    이름  나이               이메일       주소
동  홍길동  20  kildong@hong.com  서울시 강동구
서  홍길서  25   kilseo@hong.com  서울시 강서구
남  홍길남  26    south@hong.com  서울시 강남구
북  홍길북  30    north@hong.com  서울시 강북구

## 3.3 레벨 이름 지정하기

In [47]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [48]:
member_df.loc[1,'Name']

'홍길서'

In [49]:
member_df.loc[1:3,['Name','Age']]

  Name  Age
1  홍길서   25
2  홍길남   26
3  홍길북   30

In [50]:
member_df.columns = [['기본정보','기본정보','추가정보','추가정보'],
                    ['이름','나이','이메일','주소']]
member_df.columns.names = ['대분류','소분류']
member_df

대분류 기본정보                  추가정보
소분류   이름  나이               이메일       주소
0    홍길동  20  kildong@hong.com  서울시 강동구
1    홍길서  25   kilseo@hong.com  서울시 강서구
2    홍길남  26    south@hong.com  서울시 강남구
3    홍길북  30    north@hong.com  서울시 강북구

In [51]:
member_df.index = ["동","서","남","북"]
member_df.index.names = ["위치구분"]
member_df

대분류  기본정보                  추가정보
소분류    이름  나이               이메일       주소
위치구분
동     홍길동  20  kildong@hong.com  서울시 강동구
서     홍길서  25   kilseo@hong.com  서울시 강서구
남     홍길남  26    south@hong.com  서울시 강남구
북     홍길북  30    north@hong.com  서울시 강북구

In [52]:
member_df.loc['동','기본정보']['나이']

20

In [53]:
member_df.loc[['동','서'],'기본정보']

소분류    이름  나이
위치구분
동     홍길동  20
서     홍길서  25

In [59]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df.columns = [["기본정보","기본정보","추가정보","추가정보"],
                    ["이름","나이","이메일","주소"]]
member_df.index = [["좌우","좌우","상하","상하"],
                  ["동","서","남","북"]]
member_df

     기본정보                  추가정보
       이름  나이               이메일       주소
좌우 동  홍길동  20  kildong@hong.com  서울시 강동구
   서  홍길서  25   kilseo@hong.com  서울시 강서구
상하 남  홍길남  26    south@hong.com  서울시 강남구
   북  홍길북  30    north@hong.com  서울시 강북구

In [58]:
member_df.loc['좌우','기본정보']['나이']['동']

20

# 4절. 부분 데이터 조회

## 4.1 단일 열 조회

In [60]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [61]:
member_df.Name

0    홍길동
1    홍길서
2    홍길남
3    홍길북
Name: Name, dtype: object

In [62]:
type(member_df.Name)

pandas.core.series.Series

In [63]:
member_df['Name']

0    홍길동
1    홍길서
2    홍길남
3    홍길북
Name: Name, dtype: object

## 4.2 loc를 이용한 이름으로 조회

In [64]:
# loc[]을 이용하면 행 또는 열 이름으로 부분 데이터셋을 조회할 수 있음
# 다음코드는 0행부터 2행까지 출력(2행 포함). 콜론(:)은 사이의 모든 행을 선택해 줌
member_df.loc[0:2]

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구

In [65]:
member_df.loc[2]

Name                  홍길남
Age                    26
Email      south@hong.com
Address           서울시 강남구
Name: 2, dtype: object

In [66]:
member_df.loc[5] # 없는(음수) 인덱스 안 됨

KeyError: 5

In [67]:
# member_df.index = ["동","서","남","북"]
# member_df.loc["동":"남"] 이럴때는 iloc으로 인덱스 번호로 조회함

In [71]:
# loc[]은 기본적으로 행의 이름을 이용해서 부분 데이터셋을 조회
member_df.loc["Name":"Email"]

Empty DataFrame
Columns: [Name, Age, Email, Address]
Index: []

In [69]:
member_df.loc[:,"Name":"Email"]

  Name  Age             Email
0  홍길동   20  kildong@hong.com
1  홍길서   25   kilseo@hong.com
2  홍길남   26    south@hong.com
3  홍길북   30    north@hong.com

In [72]:
member_df.loc[0:2,"Name":"Email"]

  Name  Age             Email
0  홍길동   20  kildong@hong.com
1  홍길서   25   kilseo@hong.com
2  홍길남   26    south@hong.com

In [73]:
member_df.loc[[0,2],["Name","Email"]]

  Name             Email
0  홍길동  kildong@hong.com
2  홍길남    south@hong.com

## 4.3 iloc을 이용한 인덱스로 조회

In [74]:
# iloc[from_index:to_index]는 인덱스를 이용해서 부분 데이터셋을 조회
# from번째부터 to전번째까지
# to_index는 포함되지 않습니다. 인덱싱 방법은 파이썬 리스트의 인덱싱 방법을 사용
# 음수번째 가능
member_df.iloc[1:3,1:3]

   Age            Email
1   25  kilseo@hong.com
2   26   south@hong.com

In [75]:
member_df.iloc[1,1:3]

Age                   25
Email    kilseo@hong.com
Name: 1, dtype: object

In [76]:
member_df.iloc[1]

Name                   홍길서
Age                     25
Email      kilseo@hong.com
Address            서울시 강서구
Name: 1, dtype: object

In [77]:
member_df.iloc[-2:,0:2]

  Name  Age
2  홍길남   26
3  홍길북   30

In [78]:
member_df.index = ["동","서","남","북"]
member_df.iloc[0:3,0:3]

  Name  Age             Email
동  홍길동   20  kildong@hong.com
서  홍길서   25   kilseo@hong.com
남  홍길남   26    south@hong.com

In [79]:
member_df.iloc[::-1]

  Name  Age             Email  Address
북  홍길북   30    north@hong.com  서울시 강북구
남  홍길남   26    south@hong.com  서울시 강남구
서  홍길서   25   kilseo@hong.com  서울시 강서구
동  홍길동   20  kildong@hong.com  서울시 강동구

In [80]:
member_df.iloc[0::2, [1,3]]

   Age  Address
동   20  서울시 강동구
남   26  서울시 강남구

## 4.4 조건으로 조회하기

In [81]:
# p.500 sklearn.datasets
import pandas as pd
from sklearn import datasets
iris = datasets.load_iris()
x = pd.DataFrame(iris.data, columns=iris.feature_names)
y = pd.DataFrame(iris.target_names[iris.target], columns=['species'])
iris_df = pd.concat([x,y], axis=1)
iris_df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [82]:
# 조건으로 데이터 조회를 설명하기 전에 패키지를 임포트하고 예제로 사용할 
# 데이터를 불러와 데이터프레임을 만듭니다. iris데이터는 sklearn패키지의 
# 데이터셋에서 불러올 수도 있지만 데이터프레임으로 사용하려면 
# statsmodels패키지의 데이터 셋에서 불러오는 것이 더 쉽습니다.
import pandas as pd
import statsmodels.api as sm
iris = sm.datasets.get_rdataset("iris", package="datasets")
iris

In [83]:
iris_df = iris.data
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [84]:
# 결론
import statsmodels.api as sm
iris_df = sm.datasets.get_rdataset("iris",package="datasets").data
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [85]:
iris_df.iloc[0:5, :-1]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [86]:
iris_df.loc[iris_df['Species']=='versicolor'].head()

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor

In [87]:
iris_df[iris_df['Species']=='versicolor'].head() # 조건만 넣을 때는 인덱스에 조건 가능

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor

In [88]:
# versicolor종의 Sepal.Length열과 Species열 정보만 조회
iris_df.loc[iris_df['Species']=='versicolor', ['Sepal.Length','Species']].head()

    Sepal.Length     Species
50           7.0  versicolor
51           6.4  versicolor
52           6.9  versicolor
53           5.5  versicolor
54           6.5  versicolor

In [89]:
# versicolor종 중에서 Sepal.Length가 6.5보다 큰 데이터만 조회
iris_df.loc[(iris_df['Species']=='versicolor') &
           (iris_df['Sepal.Length'].astype(float) > 6.5)].head()

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width     Species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor

# 5절. 데이터 추가 및 삭제

## 5.1 데이터 프레임의 요소 삭제

In [90]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment='#')
member_df
# 1) 단일 행 삭제하기
member_df = member_df.drop(3) # axis=0(기본값)이면 행에서 찾아 삭제, labels=3
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구

In [91]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment='#')
member_df.columns = ['이름','나이','이메일','주소']
member_df.index = ['동','서','남','북']
member_df

    이름  나이               이메일       주소
동  홍길동  20  kildong@hong.com  서울시 강동구
서  홍길서  25   kilseo@hong.com  서울시 강서구
남  홍길남  26    south@hong.com  서울시 강남구
북  홍길북  30    north@hong.com  서울시 강북구

In [92]:
# 1) 단일 행 삭제하기
member_df = member_df.drop('북') # axis=0(기본값)이면 행에서 찾아 삭제 labels='북'
member_df

    이름  나이               이메일       주소
동  홍길동  20  kildong@hong.com  서울시 강동구
서  홍길서  25   kilseo@hong.com  서울시 강서구
남  홍길남  26    south@hong.com  서울시 강남구

In [93]:
member_df.drop('북') # 없는거 삭제하라 하면 에러남

KeyError: "['북'] not found in axis"

In [94]:
member_df2 = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df2.drop(2, axis=0) # 삭제한 결과를 리턴하고 member_df2에는 반영X

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
3  홍길북   30    north@hong.com  서울시 강북구

In [95]:
member_df2

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [96]:
# 2) 단일 열 삭제하기
member_df = member_df.drop('주소', axis=1) # axis=1이면 열에서 찾아 삭제
member_df

    이름  나이               이메일
동  홍길동  20  kildong@hong.com
서  홍길서  25   kilseo@hong.com
남  홍길남  26    south@hong.com

In [97]:
member_df = pd.read_csv('data/ch12_member_data.csv', comment='#')
member_df.drop(labels=['Email', 'Address'], axis=1)

  Name  Age
0  홍길동   20
1  홍길서   25
2  홍길남   26
3  홍길북   30

In [98]:
member_df.drop(labels=['Email','Address'], axis='columns')

  Name  Age
0  홍길동   20
1  홍길서   25
2  홍길남   26
3  홍길북   30

In [99]:
# 4) 열 삭제와 재할당
member_df.drop('Address', axis=1)

  Name  Age             Email
0  홍길동   20  kildong@hong.com
1  홍길서   25   kilseo@hong.com
2  홍길남   26    south@hong.com
3  홍길북   30    north@hong.com

In [100]:
#열을 삭제했지만 데이터프레임은 반영되지 않았음.
# drop()함수는 결과를 할당받아 저장해야 변경된 내용을 볼 수 있다.
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [101]:
# 재할당없이 바로 적용하기 원한다면 inplace=True속성 이용
member_df.drop('Address', axis=1, inplace=True)
member_df

  Name  Age             Email
0  홍길동   20  kildong@hong.com
1  홍길서   25   kilseo@hong.com
2  홍길남   26    south@hong.com
3  홍길북   30    north@hong.com

## 5.2 데이터프레임의 요소 추가

In [102]:
# 1)열 추가
member_df = pd.read_csv("data/ch12_member_data.csv", comment='#')
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [103]:
member_df["BirthYear"] = 2000
member_df

  Name  Age             Email  Address  BirthYear
0  홍길동   20  kildong@hong.com  서울시 강동구       2000
1  홍길서   25   kilseo@hong.com  서울시 강서구       2000
2  홍길남   26    south@hong.com  서울시 강남구       2000
3  홍길북   30    north@hong.com  서울시 강북구       2000

In [104]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment='#')
member_df["BirthYear"] = [2001, 2002, 2003, 2004]
member_df

  Name  Age             Email  Address  BirthYear
0  홍길동   20  kildong@hong.com  서울시 강동구       2001
1  홍길서   25   kilseo@hong.com  서울시 강서구       2002
2  홍길남   26    south@hong.com  서울시 강남구       2003
3  홍길북   30    north@hong.com  서울시 강북구       2004

In [105]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df["BirthYear"] = [2001,2002,2003,None]
member_df

  Name  Age             Email  Address  BirthYear
0  홍길동   20  kildong@hong.com  서울시 강동구     2001.0
1  홍길서   25   kilseo@hong.com  서울시 강서구     2002.0
2  홍길남   26    south@hong.com  서울시 강남구     2003.0
3  홍길북   30    north@hong.com  서울시 강북구        NaN

In [106]:
type(np.NaN)

float

In [107]:
# 2) 시리즈를 이용한 열 추가 (NaN의 타입이 유형이라 정수 자료형이 모두 실수로 바뀜)
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df["BirthYear"] = pd.Series([2001,2002,2004], index=[0,1,3])
member_df

  Name  Age             Email  Address  BirthYear
0  홍길동   20  kildong@hong.com  서울시 강동구     2001.0
1  홍길서   25   kilseo@hong.com  서울시 강서구     2002.0
2  홍길남   26    south@hong.com  서울시 강남구        NaN
3  홍길북   30    north@hong.com  서울시 강북구     2004.0

In [108]:
# 3) 딕셔너리로 행 추가
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [109]:
new_member = {"Name"  : "홍길동",
              "Age"   : 13,
              "Email" : "hong@abc.com",
              "Address":"서울시 마포구"}
new_df = member_df.append(new_member, ignore_index=True)
new_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구
4  홍길동   13      hong@abc.com  서울시 마포구

In [110]:
# 4)리스트로 행 추가
new_list = ["파이썬", 13, "abc@abc.com","서울시 마포구"]
new_series = pd.Series(new_list, index=member_df.columns)
new_df = member_df.append(new_series, ignore_index=True)
new_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구
4  파이썬   13       abc@abc.com  서울시 마포구

In [111]:
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

In [114]:
# 5) 시리즈를 이용한 리스트 데이터의 행 추가
new_list = ["김길동", 48, "abc@abc.com","인천시 서구"]
new_series = pd.Series(new_list, index=member_df.columns)
new_series

Name               김길동
Age                 48
Email      abc@abc.com
Address         인천시 서구
dtype: object

In [115]:
new_df = member_df.append(new_series, ignore_index=True)
new_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구
4  김길동   48       abc@abc.com   인천시 서구

In [116]:
new_member = pd.DataFrame([{"Name"  : "이순신",
              "Age"   : 30,
              "Email" : "hong@abc.com",
              "Address":"서울시 마포구"}])
new_member

  Name  Age         Email  Address
0  이순신   30  hong@abc.com  서울시 마포구

In [118]:
new_member = pd.DataFrame({"Name"  : ["이순신"],
              "Age"   : [30],
              "Email" : ["hong@abc.com"],
              "Address":["서울시 마포구"]})
new_member

  Name  Age         Email  Address
0  이순신   30  hong@abc.com  서울시 마포구

In [119]:
new_df = member_df.append(new_member)
new_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구
0  이순신   30      hong@abc.com  서울시 마포구

In [120]:
new_df.index = range(len(new_df))
new_df.index

RangeIndex(start=0, stop=5, step=1)

In [121]:
new_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구
4  이순신   30      hong@abc.com  서울시 마포구

In [122]:
member_df # append함수는 값만 리턴할 쁜 member_df를 바꾸진 않는다

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길남   26    south@hong.com  서울시 강남구
3  홍길북   30    north@hong.com  서울시 강북구

# 6절. 정렬

## 6.1 행이름으로 정렬

In [123]:
import pandas as pd
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df.index = ["동","서","남","북"]
member_df

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길남   26    south@hong.com  서울시 강남구
북  홍길북   30    north@hong.com  서울시 강북구

In [124]:
member_df.sort_index(axis=0)

  Name  Age             Email  Address
남  홍길남   26    south@hong.com  서울시 강남구
동  홍길동   20  kildong@hong.com  서울시 강동구
북  홍길북   30    north@hong.com  서울시 강북구
서  홍길서   25   kilseo@hong.com  서울시 강서구

## 6.2 열 이름으로 열 순서 바꾸기

In [125]:
member_df.sort_index(axis=1)

   Address  Age             Email Name
동  서울시 강동구   20  kildong@hong.com  홍길동
서  서울시 강서구   25   kilseo@hong.com  홍길서
남  서울시 강남구   26    south@hong.com  홍길남
북  서울시 강북구   30    north@hong.com  홍길북

In [126]:
member_df # sort_index함수도 값을 리턴할 뿐 member_df를 바꾸진 않는다

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길남   26    south@hong.com  서울시 강남구
북  홍길북   30    north@hong.com  서울시 강북구

In [127]:
member_df.sort_index(axis=0, inplace=True)

In [128]:
member_df

  Name  Age             Email  Address
남  홍길남   26    south@hong.com  서울시 강남구
동  홍길동   20  kildong@hong.com  서울시 강동구
북  홍길북   30    north@hong.com  서울시 강북구
서  홍길서   25   kilseo@hong.com  서울시 강서구

## 6.3 값으로 정렬

In [129]:
member_df.sort_values(by=["Email"])

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
북  홍길북   30    north@hong.com  서울시 강북구
남  홍길남   26    south@hong.com  서울시 강남구

In [130]:
member_df

  Name  Age             Email  Address
남  홍길남   26    south@hong.com  서울시 강남구
동  홍길동   20  kildong@hong.com  서울시 강동구
북  홍길북   30    north@hong.com  서울시 강북구
서  홍길서   25   kilseo@hong.com  서울시 강서구

In [131]:
member_df.sort_values(by="Email", inplace=True)

In [132]:
member_df

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
북  홍길북   30    north@hong.com  서울시 강북구
남  홍길남   26    south@hong.com  서울시 강남구

In [133]:
new_series = pd.Series(["홍길동",10,"kildong@hong.com", "서울시 마포구"],
                      index=member_df.columns)
member_df = member_df.append(new_series, ignore_index=True)
member_df

  Name  Age             Email  Address
0  홍길동   20  kildong@hong.com  서울시 강동구
1  홍길서   25   kilseo@hong.com  서울시 강서구
2  홍길북   30    north@hong.com  서울시 강북구
3  홍길남   26    south@hong.com  서울시 강남구
4  홍길동   10  kildong@hong.com  서울시 마포구

In [134]:
member_df.index = ["동","서","남","북","중"]
member_df

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길북   30    north@hong.com  서울시 강북구
북  홍길남   26    south@hong.com  서울시 강남구
중  홍길동   10  kildong@hong.com  서울시 마포구

In [135]:
member_df.sort_values(by=["Email", "Age"])

  Name  Age             Email  Address
중  홍길동   10  kildong@hong.com  서울시 마포구
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길북   30    north@hong.com  서울시 강북구
북  홍길남   26    south@hong.com  서울시 강남구

In [136]:
member_df.sort_values(by=["Email", "Age"], ascending=False)

  Name  Age             Email  Address
북  홍길남   26    south@hong.com  서울시 강남구
남  홍길북   30    north@hong.com  서울시 강북구
서  홍길서   25   kilseo@hong.com  서울시 강서구
동  홍길동   20  kildong@hong.com  서울시 강동구
중  홍길동   10  kildong@hong.com  서울시 마포구

In [137]:
member_df

  Name  Age             Email  Address
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길북   30    north@hong.com  서울시 강북구
북  홍길남   26    south@hong.com  서울시 강남구
중  홍길동   10  kildong@hong.com  서울시 마포구

In [138]:
member_df.sort_values(by=["Email", "Age"], inplace=True)

In [139]:
member_df

  Name  Age             Email  Address
중  홍길동   10  kildong@hong.com  서울시 마포구
동  홍길동   20  kildong@hong.com  서울시 강동구
서  홍길서   25   kilseo@hong.com  서울시 강서구
남  홍길북   30    north@hong.com  서울시 강북구
북  홍길남   26    south@hong.com  서울시 강남구

## 6.4 레벨로 정렬

In [140]:
member_df = pd.read_csv("data/ch12_member_data.csv", comment="#")
member_df.columns = [["기본정보","기본정보","추가정보","추가정보"],
                     ["이름","나이","이메일","주소"]]
member_df.columns.names = ["정보구분","상세정보"]
member_df

정보구분 기본정보                  추가정보
상세정보   이름  나이               이메일       주소
0     홍길동  20  kildong@hong.com  서울시 강동구
1     홍길서  25   kilseo@hong.com  서울시 강서구
2     홍길남  26    south@hong.com  서울시 강남구
3     홍길북  30    north@hong.com  서울시 강북구

In [141]:
member_df.index=[["좌우","좌우","상하","상하"],
                 ["동","서","남","북"]]
member_df.index.names = ["위치구분","상세위치"]
member_df

정보구분      기본정보                  추가정보
상세정보        이름  나이               이메일       주소
위치구분 상세위치
좌우   동     홍길동  20  kildong@hong.com  서울시 강동구
     서     홍길서  25   kilseo@hong.com  서울시 강서구
상하   남     홍길남  26    south@hong.com  서울시 강남구
     북     홍길북  30    north@hong.com  서울시 강북구

In [142]:
member_df.sort_index(level=["위치구분"])

정보구분      기본정보                  추가정보
상세정보        이름  나이               이메일       주소
위치구분 상세위치
상하   남     홍길남  26    south@hong.com  서울시 강남구
     북     홍길북  30    north@hong.com  서울시 강북구
좌우   동     홍길동  20  kildong@hong.com  서울시 강동구
     서     홍길서  25   kilseo@hong.com  서울시 강서구

In [143]:
member_df.sort_index(level=["상세위치"])

정보구분      기본정보                  추가정보
상세정보        이름  나이               이메일       주소
위치구분 상세위치
상하   남     홍길남  26    south@hong.com  서울시 강남구
좌우   동     홍길동  20  kildong@hong.com  서울시 강동구
상하   북     홍길북  30    north@hong.com  서울시 강북구
좌우   서     홍길서  25   kilseo@hong.com  서울시 강서구

# 7절. 기초 통계 분석
- count : NA를 제외한 갯수
- min : 최소값
- max : 최대값
- sum : 합
- cumprod : 누적합
- mean : 평균
- median : 중앙값
- quantile : 분위수
- corr : 상관관계
- var : 표본분산
- std : 분산

In [144]:
import statsmodels.api as sm
iris = sm.datasets.get_rdataset("iris", package="datasets")
iris_df = iris.data
iris_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [145]:
type(iris_df)

pandas.core.frame.DataFrame

## 7.1 최소값, 최대값, 평균, 중위수

In [146]:
iris_df.min() #axis=0 생략 shift+tab+tab하면 알 수 있음

Sepal.Length       4.3
Sepal.Width          2
Petal.Length         1
Petal.Width        0.1
Species         setosa
dtype: object

In [147]:
iris_df.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

In [148]:
iris_df.mean()

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [149]:
iris_df.median()

Sepal.Length    5.80
Sepal.Width     3.00
Petal.Length    4.35
Petal.Width     1.30
dtype: float64

In [150]:
iris_df.var()

Sepal.Length    0.685694
Sepal.Width     0.189979
Petal.Length    3.116278
Petal.Width     0.581006
dtype: float64

In [151]:
iris_df.std()

Sepal.Length    0.828066
Sepal.Width     0.435866
Petal.Length    1.765298
Petal.Width     0.762238
dtype: float64

In [152]:
iris_df.quantile(q=[0.0, 0.25,0.5,0.75,1.0], interpolation='nearest')

      Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0.00           4.3          2.0           1.0          0.1
0.25           5.1          2.8           1.6          0.3
0.50           5.8          3.0           4.3          1.3
0.75           6.4          3.3           5.1          1.8
1.00           7.9          4.4           6.9          2.5

## 7.2 요약 통계량

In [153]:
# 1) 기본 요약 통계량
iris_df.describe() # 숫자열에서의 요약 통계량

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [154]:
iris_df.Species.describe() # 숫자열이 없는 개체에서의 요약 통계량

count           150
unique            3
top       virginica
freq             50
Name: Species, dtype: object

In [155]:
iris_df['Sepal.Length'].describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: Sepal.Length, dtype: float64

In [156]:
iris_df.columns = [col.lower().replace('.','_') for col in iris_df.columns]
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [157]:
# 2) include와 exclude
import pandas as pd
df = pd.DataFrame({'a':[1,2]*3,
                   'b':[True, False]*3,
                   'c':[2.0,4]*3})
df

   a      b    c
0  1   True  2.0
1  2  False  4.0
2  1   True  2.0
3  2  False  4.0
4  1   True  2.0
5  2  False  4.0

In [158]:
df.describe()# b열 논리값을 가지므로 기본 요약 통계량 출력에서 제외

              a         c
count  6.000000  6.000000
mean   1.500000  3.000000
std    0.547723  1.095445
min    1.000000  2.000000
25%    1.000000  2.000000
50%    1.500000  3.000000
75%    2.000000  4.000000
max    2.000000  4.000000

In [159]:
# include 및 exclude 매개변수를 사용하여 DataFrame에서 출력용으로 
# 분석되는 열을 제한할 수 있다.
# Series를 분석할 때는 매개변수는 무시된다

# 정수 유형 열에 대해서만 요약통계량을 출력
df.describe(include=["int64"])

              a
count  6.000000
mean   1.500000
std    0.547723
min    1.000000
25%    1.000000
50%    1.500000
75%    2.000000
max    2.000000

In [160]:
df.describe(include=["bool","float64"])

           b         c
count      6  6.000000
unique     2       NaN
top     True       NaN
freq       3       NaN
mean     NaN  3.000000
std      NaN  1.095445
min      NaN  2.000000
25%      NaN  2.000000
50%      NaN  3.000000
75%      NaN  4.000000
max      NaN  4.000000

In [161]:
df.describe(exclude=['bool','float64'])

              a
count  6.000000
mean   1.500000
std    0.547723
min    1.000000
25%    1.000000
50%    1.500000
75%    2.000000
max    2.000000

In [162]:
df.describe(include='all')

               a     b         c
count   6.000000     6  6.000000
unique       NaN     2       NaN
top          NaN  True       NaN
freq         NaN     3       NaN
mean    1.500000   NaN  3.000000
std     0.547723   NaN  1.095445
min     1.000000   NaN  2.000000
25%     1.000000   NaN  2.000000
50%     1.500000   NaN  3.000000
75%     2.000000   NaN  4.000000
max     2.000000   NaN  4.000000

In [163]:
df.describe(exclude=['float64'])

               a     b
count   6.000000     6
unique       NaN     2
top          NaN  True
freq         NaN     3
mean    1.500000   NaN
std     0.547723   NaN
min     1.000000   NaN
25%     1.000000   NaN
50%     1.500000   NaN
75%     2.000000   NaN
max     2.000000   NaN

In [164]:
# include와 exclude에 같은 유형을 사용하면 오류가 발생
df.describe(include=['int64'], exclude=['int64','float64'])

ValueError: include and exclude overlap on frozenset({<class 'numpy.int64'>})

## 7.3 분산, 표준편차

In [165]:
iris_df.var() # 분산 (표준편차 * 표준편차)

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [167]:
iris_df.std() # 표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [168]:
import numpy as np
np.sqrt(iris_df.var()) # 분산의 제곱근은 표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

## 7.4 공분산, 상관계수

In [169]:
# 공분산
# Cov(X,Y) = E( (X-x뮤)(Y-y뮤) ) = X(XY) - x뮤*y뮤
# X와Y가 독립이면 공분산은 0
# https://destrudo.tistory.com/15
iris_df.cov()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      0.685694    -0.042434      1.274315     0.516271
sepal_width      -0.042434     0.189979     -0.329656    -0.121639
petal_length      1.274315    -0.329656      3.116278     1.295609
petal_width       0.516271    -0.121639      1.295609     0.581006

In [170]:
iris_df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000